[
  {
    "id": 1168190,
    "title": "더 레킹 크루",
    "original_title": "The Wrecking Crew",
    "runtime": 124,
    "directors": [
      "앙헬 마누엘 소토"
    ],
    "genres": [
      "액션",
      "코미디",
      "범죄"
    ],
    "overview": "'더 레킹 크루'는 사이가 멀어진 이복형제의 이야기를 다룬다. 조니와 제임스는 아버지의 의문스러운 죽음 이후 다시 뭉치게 된다. 진실을 쫓는 과정에서 묻혀 있던 비밀들이 밝혀지고, 가족을 갈라놓을 수 있는 거대한 음모가 드러난다.",
    "release_date": "2026-01-28",
    "vote_average": 6.506,
    "vote_count": 242,
    "poster_path": "https://image.tmdb.org/t/p/w500/bG8BPNRoOvTC9wIos7DIH1YWOqN.jpg",
    "keywords": [
      "reunion",
      "amused"
    ],
    "cast": [
      "데이브 바티스타(James Hale)",
      "제이슨 모모아(Jonny Hale)",
      "테무에라 모리슨(Governor Peter Mahoe)",
      "모레나 바카린(Valentina)",
      "Roimata Fox(Leila Hale)"
    ],
    "reviews_positive": [],
    "reviews_negative": [
      "\"The Wrecking Crew\" is aptly named. \r\n\r\nThis action flick, for me, early on wrecked any chance that I'd actually enjoy this film. I'll put my hand up and say I'm sick and tired of the gratuitous violence oozing out of Hollywood. The light, jokey tone of this film is at odds with oftentimes really ugly violence. Entirely smashing someone's upper teeth against a table in the opening scenes is one such example. It's not funny; it's not okay, its not entertaining, no matter who it's done to.\r\n\r\nRegrettably, given how violent US society is, perhaps I should not be surprised, but it's also one of the reasons I don't watch a great deal of US cinema these days.\r\n\r\nBeyond that, the actions of the formulaic variety and the bro buddy back story has long since ossified into a cliche. \r\n\r\nIn summary, tone it down, Hollywood. Excessive violence is not okay. If you want to make a light-toned action flick, then try doing just that.",
      "This is a good sequel to the South Park episode. A relatively uninspired action buddy comedy where they just throw in that the guy is a cop and the other guy is a seal. Or are they both seals? You know...there's a lot you don't need to know in this. You don't need to watch it but you can and you won't be surprised nor disappointed."
    ]
  },
  {
    "id": 1084242,
    "title": "주토피아 2",
    "original_title": "Zootopia 2",
    "runtime": 108,
    "directors": [
      "재러드 부시",
      "바이런 하워드"
    ],
    "genres": [
      "애니메이션",
      "코미디",
      "모험",
      "가족",
      "미스터리"
    ],
    "overview": "미스터리한 뱀 게리가 나타난 순간, 주토피아가 다시 흔들리기 시작했다! 혼란에 빠진 도시를 구하기 위해 환상의 콤비 주디와 닉이 잠입 수사에 나서고 상상 그 이상의 진실과 위협을 마주하게 되는데...!",
    "release_date": "2025-11-26",
    "vote_average": 7.638,
    "vote_count": 1450,
    "poster_path": "https://image.tmdb.org/t/p/w500/ib6v6qUXzez1x2qIOLN7C0yJNPQ.jpg",
    "keywords": [
      "snake",
      "bunny",
      "fox",
      "cop",
      "sequel",
      "anthropomorphism",
      "animals",
      "displacement",
      "buddy cop",
      "buddy comedy",
      "complex",
      "playful",
      "talking animal",
      "3d animation",
      "embarrassed",
      "excited"
    ],
    "cast": [
      "지니퍼 굿윈(Judy Hopps (voice))",
      "제이슨 베이트먼(Nick Wilde (voice))",
      "키호이콴(Gary De'Snake (voice))",
      "포춘 페임스터(Nibbles Maplestick (voice))",
      "앤디 샘버그(Pawbert Lynxley (voice))"
    ],
    "reviews_positive": [
      "Very short: Zootopia 2 is lovely and has as many little details about the world and everyone within it as the first one. If you enjoyed the first one, you'll enjoy this one.\r\n\r\nLonger:\r\nZootopia 2 basically does what the first one already did: Using the story of a police case to teach people, inside and outside of the movie, that prejudice and stereotypes we learned to believe are often wrong and even more often dangerous. In addition, it also features other themes like stolen land, and that ultimately what makes \"you\" is your decisions in the situations you're dealt.\r\n\r\n(Important) moral of the story aside: Zootopia 2 is as beautiful, maybe even more, as the first one. Such beautiful colors, so many moving parts and animals, such great detail on soft surfaces and, of course, fur.\r\nThanks to that, Judy (and the others) look even more beautiful and detailed with so many individual hairs and such awesome effects when things get wet.\r\nThe same applies to stuff like water in general, snow and sand.\r\n\r\nLike in the first movie, so many little details are shown in the world: How different species work together, how different sizes and skills are used and how buildings and facilities are built to accommodate all the different species.\r\n\r\nEmotionally the movie is also as lovely as the first one: Many jokes, Judy's overly positive optimism and Nick's cynicism do the same job as in the first one. Only this time the movie actually goes and deals with how both of these traits of them are also used to mask their emotional weakness and how they deal with them. (Although I personally feel Judy gets off the hook a little easy, but well, details.)\r\n\r\nAnd, as is proper after the first one, there's also at least one tear-jerking emotional part.\r\n\r\nSo, I recommend that movie. The \"police story\" in it, I think I actually preferred the case from the first movie. But that little bit aside, characters and details are equally as lovely.\r\n\r\nI recommend it, and I'm looking forward to Zootopia 3!",
      "FULL SPOILER-FREE REVIEW @ https://movieswetextedabout.com/zootopia-2-movie-review-disney-proves-it-can-still-make-sequels-with-soul-and-purpose/\r\n\r\nRating: A-\r\n\r\n\"Zootopia 2 asserts itself as a worthy and even necessary sequel, overcoming the natural loss of the novelty factor with a narrative that dares to dig deeper into the imperfect foundations of its utopia.\r\n\r\nAlthough the mystery doesn't reach the suspenseful peaks of its predecessor, the film makes up for it with dazzling visual evolution, a voice cast in a state of grace, and a mature exploration of the partnership between Judy and Nick. It's a movie that entertains as much as it provokes thought, refusing to offer easy answers to complex problems like historical erasure and social exclusion.\r\n\r\nMore than just a simple animated adventure, this is a story about the responsibility to remember and correct, inspiring us to believe that building a better world requires the courage to look back so we can, finally, move forward together.\"",
      "Things are not looking so hot for this animal equivalent of “Dempsey and Makepeace” after one of their clandestine operation goes especially pear-shaped and the boss threatens to split up “Hopps” and “Wilde”. The former is probably the more professional of the two and after discovering something distinctly scaly at a grand civic reception that goes wrong, allies with her foxy partner to get to the bottom of a secret that might involve a grandma, a patent and a seemingly harmless metal-covered journal. Meantime, the local bigwig lynxes seem determined to thwart these detective activities, so we have to assume that their status as town grandees isn’t what it seems - but with everyone sceptical about our dynamic duo, what chance they can get to the truth? Aside from just being quite an enjoyably paced adventure, this also has a bit more substance as a story that shines some light on prejudice and stereotyping. That’s done in an entertaining and under-the-radar fashion, but it’s still quite clearly illustrating the “never judge a book by it’s cover” philosophy as well as taking a pop at good, old-fashioned, greed. The detail in the production is often the source of more for the adults amongst the audience, and there’s quite a bit of humour for all ages from the dialogue and the tea-time menace that gradually accumulates amidst the snowy mountain tops. The quality of the animation, particularly the facial expressions but also the acrobatics, is entertainingly colourful with plenty of daft antics to test the loyalties of friends old and new. Maybe “Zootopia” isn’t quite as it seems? Maybe it never was? Good fun."
    ],
    "reviews_negative": []
  },
  {
    "id": 1419406,
    "title": "포풍추영",
    "original_title": "捕风追影",
    "runtime": 142,
    "directors": [
      "杨子"
    ],
    "genres": [
      "액션",
      "범죄",
      "드라마",
      "스릴러"
    ],
    "overview": "첨단 감시 시스템과 삼엄한 보안망을 무력화하고, 수십억을 탈취한 정체불명의 범죄 조직. 통제 불능의 범죄에 마카오 경찰은 결국 은퇴한 전설의 범죄 추적 전문가 ‘황더중’에게 도움을 요청한다. 황더중은 신입 경찰 ‘허추궈’와 함께 최정예 감시반을 구성해, 범죄 조직의 수장 ‘푸룽성’을 추적하기 시작한다. 하지만 수사망이 조여올수록 상대의 덫과 함정은 더욱 교묘해지고, 예상치 못한 반격 속에 황더중 역시 추적당하기 시작하는데…",
    "release_date": "2025-08-16",
    "vote_average": 7.192,
    "vote_count": 382,
    "poster_path": "https://image.tmdb.org/t/p/w500/pUCkdO40PWHdvU1GEYV6ywY7li2.jpg",
    "keywords": [
      "excited"
    ],
    "cast": [
      "성룡(Wong Tak Chung)",
      "장자풍(He Qiuguo)",
      "양가휘(Fu Longsheng)",
      "차사(Simon / Xiwang)",
      "준(Hu Feng)"
    ],
    "reviews_positive": [
      "A return to form Jackie Chan and a scene-stealing Tony Leung Ka-Fai lead Larry Yang's gritty action thriller.",
      "Right from the outset, this doesn’t hang about as a near perfectly executed crypto robbery is carried out by a gang of young men in Macau. Despite mobilising the police and the several thousand cameras located across the city, the cops are short on clues so they draft in retired “Wong” (Jackie Chan) whose meticulous approach to his work soon leads them to suspect that the legendary “Shadow” is masterminding a group of ninja-esque men who are masters of disguise, martial arts and technology. He decides that the only way to track this man down is to recruit a squad of officers that don’t look remotely like they are investigating and then to embark on the mother of all door-to-door searches. Of course, and maybe a little implausibly, they manage to identify him (Tony Leung) - we know who it is right from the start - and a war of attrition ensues not just between the two men, but amongst their nemesis’s increasingly manoeuvred and conflicted “family” for whom trust and loyalty are soon severely tested. There is loads of action throughout, but it’s not the repetitious sort. More stylishly and tightly edited and choreographed with no windows, bones or furniture safe as the CGI and the action mix well before a denouement that offers us something of a twist and perhaps the scent of a revenge sequel down the line. The charismatic Chan brings a considered charm to his role, most of his antagonists are very agile and easy on the eye and Leung really does bring a little of the “Fu Manchu” to his character - powerful, menacing and always one step ahead. You might not be so certain about the safety of your bit-coin billions after watching this, though!",
      "\"The Shadows Edge\" is yet another Hong Kong action thriller starring the actor named number one with movie fans in the region, Jackie Chan.\r\n\r\nThis film is good but its by no means great. Chan is a cop called back from retirement, when modern policing techniques conspicuously fail to catch, an ageing criminal, an expert in counter surveillance and his talented team of young cyber thieves.\r\n\r\nActions plentiful, with Chan's trademark, creative flair, using the environment and  everyday items, as devices for martial arts action. This is topped off with, at times, intense gun play and spectacular explosions. Taken together, these aspects, of this cinematic experience, represent an engaging romp.\r\n\r\nThe noticeable downside is this film is overly long. The result is the story, at times, becomes difficult to follow and the characterisations, can feel either drawn out or a bit overlooked.\r\n\r\nIn summary, a mostly decent action thriller with a, by now, well established, Hong Kong flavour. Would have benefited from a tighter script and shorter length. That said, still very much worth a look."
    ],
    "reviews_negative": []
  },
  {
    "id": 1306368,
    "title": "더 립",
    "original_title": "The Rip",
    "runtime": 113,
    "directors": [
      "조 카나한"
    ],
    "genres": [
      "액션",
      "스릴러",
      "범죄"
    ],
    "overview": "허름한 은닉처에서 수백만 달러의 현금을 발견한 마이애미 경찰. 신뢰에 금이 가기 시작하면서 모든 사람, 모든 것이 의심의 대상이 된다.",
    "release_date": "2026-01-13",
    "vote_average": 7.021,
    "vote_count": 1006,
    "poster_path": "https://image.tmdb.org/t/p/w500/o0d6Us9VWOW0nHhoB7ZNIwigARG.jpg",
    "keywords": [
      "miami, florida",
      "police",
      "dirty cop",
      "trust",
      "angry",
      "hidden money",
      "anxious",
      "serious"
    ],
    "cast": [
      "맷 데이먼(Lieutenant Dane Dumars)",
      "벤 애플렉(Detective Sergeant J.D. Byrne)",
      "스티븐 연(Detective Mike Ro)",
      "테야나 테일러(Detective Numa Baptistie)",
      "카타리나 산디노 모레노(Detective Lolo Salazar)"
    ],
    "reviews_positive": [
      "Full review: https://movieswetextedabout.com/the-rip-movie-review-matt-damon-and-ben-affleck-shine-in-a-twisty-thriller-that-surpasses-expectations/\r\n\r\nRating: B\r\n\r\n\"The Rip reveals itself to be an intriguing surprise that swaps easy pyrotechnics for psychological tension, leaning on the undeniable charisma of the Matt Damon and Ben Affleck duo and a steady direction by Joe Carnahan that values spatial containment. Despite a lack of deeper secondary character development, the film stands out for the honesty with which it treats its themes and its refusal to betray the logic of its protagonists in favor of mindless spectacle. It’s a raw portrait of the fragility of human bonds when faced with absolute temptation that doesn’t deserve to go unnoticed.\""
    ],
    "reviews_negative": [
      "The Rip: A Knives Out Mystery\r\n\r\nConvoluted bullshit mystery. How many plates can you spin Mr. Damon? You are incredible and Ben...just does exactly what you know he'll do. Which is the right thing because you are all so just.\r\n\r\nWell done officers. Could have been shorter."
    ]
  },
  {
    "id": 1242898,
    "title": "프레데터: 죽음의 땅",
    "original_title": "Predator: Badlands",
    "runtime": 107,
    "directors": [
      "댄 트랙턴버그"
    ],
    "genres": [
      "액션",
      "SF",
      "모험"
    ],
    "overview": "프레데터로서 존재를 증명하기 위해 우주에서 가장 위험한 행성으로 첫 사냥에 나선 덱. 죽음의 땅에 도사린 모든 것으로부터 공격을 받던 순간, 휴머노이드 티아를 만난다. 최상위 포식자 칼리스크에 맞서게 된 둘은 생존과 각자의 목적을 위해 극한의 사투를 벌이게 되는데…",
    "release_date": "2025-11-05",
    "vote_average": 7.761,
    "vote_count": 1771,
    "poster_path": "https://image.tmdb.org/t/p/w500/8lpCbwbYh9SSzCFsHDndZHKrcD4.jpg",
    "keywords": [
      "survival",
      "outcast",
      "alien planet",
      "team up",
      "audacious"
    ],
    "cast": [
      "엘르 패닝(Thia / Tessa)",
      "Dimitrius Schuster-Koloamatangi(Dek / Father)",
      "Ravi Narayan(Bud)",
      "Michael Homick(Kwei (Suit))",
      "Stefan Grube(Kwei (voice))"
    ],
    "reviews_positive": [
      "Predator: Badlands is the first Predator film since 2022’s Prey. It is also the second Predator-related media released this year. Hulu’s animated anthology film, Predator: Killer of Killers, is now streaming. All three titles were directed and/or written by Dan Trachtenberg.\r\n\r\nBadlands follows Dek, a young Predator who yearns for his father's approval but struggles to escape the shadow of his bigger and older brother Kwei. Their father, viewing proud Yautja lineage as something reserved for only the strongest, sees Dek as weak and useless—wanting him dead to preserve the family’s honor. Dek’s perceived weakness, being the runt, drives both his father’s harsh stance and Dek’s desperate need to prove himself.\r\n\r\nHowever, Kwei believes Dek deserves a chance to prove himself, hoping Dek can live up to his family's legacy. Predators choose their prey. Dek, eager to earn his father's respect and prove he’s not only a worthy warrior but also superior, selects Genna—a planet with a low survival rate. Dek chooses the Kalisk as his target, a predator believed to be unkillable, in an attempt to demonstrate his own fearlessness. When Dek’s father kills Kwei, Dek’s drive turns to vengeance, and, after surviving and escaping to Genna, he must now capture the Kalisk both to prove himself and to avenge his brother.\r\n\r\nThe Yautja are a proud and stubborn race that hunts alone. Dek tries to prove himself by surviving the perils of Genna. He reluctantly saves Thia (Elle Fanning), a damaged synthetic, hoping she can guide him. Thia says she's searching for her sister, Tessa, and knows where the Kalisk is, motivated by the desire for reunion. Dek brings her, unaware that he and the Weyland-Yutani Corporation pursue the same prey for their own ends.\r\nBadlands is a lot of firsts for the Predator franchise. It’s the first time a Predator was named in any film. It is also the first time a Predator is a protagonist. The Yautja language was created by Britton Watkins, who was recommended by Paul Frommer, the creator of the Na’vi language for Avatar.\r\n\r\nDan Trachtenberg is eager to build a new Alien vs. Predator film or franchise, but wants to do it right. Predator: Badlands includes Easter eggs connecting those two cinematic universes and one more.\r\nBadlands features pulse rifles from Aliens. The Weyland-Yutani logo on the back of Thia’s eyes resembles Andy’s eyes in Alien: Romulus. Dek’s armor and weapon preparation before the final battle is an homage to Amber Midthunder’s in Prey, which was already a nod to Dutch’s prep before the last battle in the original Predator. Tessa uses a power loader similar to the one Ripley uses to fight the Alien Queen in Aliens. A Harvester skull from Independence Day is visible on Kwei’s trophy wall.\r\n\r\nBadlands runs a tight 107 minutes and is nearly nonstop action. Influences include Frank Frazetta, Terrence Malick, films like Shane (1953), The Road Warrior, Conan the Barbarian, The Book of Eli, Clint Eastwood westerns, Jaws, Terminator 2: Judgment Day, and Star Wars; video games such as Shadow of the Colossus, Half-Life 2, Uncharted, God of War; and the comic book character Drax the Destroyer.\r\nGenna is so deadly that Dek is surrounded by wildlife and otherworldly creatures out to kill him. \r\n\r\nPredator: Badlands channels Mad Max: Fury Road, letting non-stop action lead until the credits. Emphasis on the Yautja language (a universal translator allows characters to hear their native tongue), brutal action, and animals in the storyline give Badlands an ambiance similar to Genndy Tartakovsky’s animated epic, Primal.\r\n\r\nBadlands has more visual effects shots than any other Predator film. The film credits several VFX studios, including Weta Workshop and ILM, for bringing this visual powerhouse to life. The film looks incredible, thanks in part to its breathtaking cinematography and nearly flawless visual effects. Each action sequence blends creativity, intense violence, and masterful CGI. Every battle is unforgettable, like when Dek cuts a bone bison in half in slow-motion with his plasma sword. The film skirts its PG-13 rating through violence, avoiding an R-rating since almost all onscreen blood is green from predators or white from synthetics.\r\n\r\nThe only flaw in Predator: Badlands is its straightforwardness and lack of depth. However, this film doesn't need complexity. It's easily one of the year's best action movies. Trachtenberg references past franchise films without simply repeating stories. You're invested in Dek, Thia, and Bud (a native creature bonded to Dek), and you notice almost every Easter egg. Yet, the story still feels fresh. Wherever Predator goes next, it promises a new journey for fans.\r\n\r\nSavage, badass, and brutal, Predator: Badlands is the most action-packed Predator film yet. See this one in theaters for the best picture and sound—it’s worth every penny.",
      "> Director of his 3rd Predator project, I think…3 times a charm…Dan Trachtenburg , obviously understands Alien. I think he brought the “aliens” in Cameron style to this pg13  Disney +  friendly film. So maybe for a  newer audience that wants to understand and identify with the originals. Movies now get “universe” in comic book format is how we lay film work. New normal. So get with the program, ya hard-to-please Treky Boomers. If you watch Badlands with all things considered, you find it delivers well. The originators of Alien and sci-fi alike also started woke back then. The real kind . It was green peace hippie and comic book loving pc building movie magic “woke” nowadays, so it’s not hard to see how the concepts and themes in the Badlands plot and story and character developments blended and balanced together with high energy ramping up music score. Cyberpunk space synth composed like an opera complemented the vibe in place far, far away ; ). Excellent delivery execution with precision made woke but like like a fine woke wine.",
      "\"What time is it? It's !@#$% r@ping time!\"\r\n\r\nWrong movie in the franchise, I know, but I can't help it. I like me some Walton Goggins!\r\n\r\nI really like this movie for finally giving us a different perspective.\r\n\r\nI was concerned that this movie would irritate me after Prey (2022)'s ending irritated me, but I was pleasantly surprised, and I am now looking forward to the next entry from this director. I hope he doesn't !@#$ it up somehow.\r\n\r\n**MINOR SPOILERS AHEAD:**\r\n\r\nDek, Thia, and Bud, join Dutch, as my favorite characters in this franchise.\r\n\r\nBud is just absolutely adorable throughout the movie. My favorite Bud scenes are:\r\n1. Dek and Thia's first meeting with Bud.\r\n2. Bud mimicking Dek by the fire.\r\n3. Bud waving the severed arm.\r\n\r\nBadlands (2025) joins Predator (1987) and Predators (2010) as my favorite movies in the franchise:\r\n1. Predator (1987), Predators (2010), Badlands (2025)\r\n2. Killer of Killers (2025)\r\n3. Prey (2022) -- Should have extended the final fight instead of making the Predator act so stupid. That's how I remember it anyway.\r\n4. Alien vs. Predator (2004), The Predator (2018)\r\n6. Predator 2 (1990) -- Last because the acting is so atrocious that it distracts from the movie.\r\n\r\nI don't think I've seen Aliens vs Predator: Requiem (2007)."
    ],
    "reviews_negative": [
      "\"Predator Soy Boy\" shows us all that no matter how wimpy you are, the power of diversity, equality and inclusion, is on your side. Biology be damned.\r\n\r\nSuffice to say, this is a rather ridiculous take on the Predator universe. Weird looking Dik oops I mean Dek, is the wussiest of the predators. Dad who dresses like a demonic deer, wants to croak Dek, for this very reason. Of course, he could have done so in infancy, as the Spartans did, if this is the kind of society they inhabit. Anyway for no obvious reason he lets Dek hang around embarrassing him and because its such a hassle to do him in, gets his brother do the dirty, for him. Big brother refuses, dad goes full psycho and kills him, whilst Dek escapes, if that's the right word, to a hellish planet, to take on a creature all the tough, macho predators, are scared of. \r\n\r\nYou can see where this is going and it doesn't get better but then how could it? Its premise is downright silly, akin to Pee-Wee Herman, taking a starring role in a Rocky remake.  Just to make it extra cringy, they have a female humanoid cyborg, who helps Dek get in touch with this feelings.Plus an almost Muppety thing, that vaguely feels like a substitute for a dog (or maybe a pet monkey?). \r\n\r\nUpdsides such as they are include admittedly decent action, creative and well rendered special effects and yes a few scary monsters. \r\n\r\nIn summary, a rather anemic take on the Predator universe, that drags the franchise even further from its tough guy, action roots, to a more drippy, touchy feely propostion that reminds me of a rough hewen take, on Beauty and the Beast(s). A marginal watch."
    ]
  }
]